
def area(a):
    '''
    Возвращает площадь квадрата
        
        Параметры:
            a (int | float): длина стороны квадрата

        Возвращаемое значение:
            area (int | float): площадь квадрата со стороной
                длиною a; может быть как целым числом (int),
                так и с плавающей точкой (float), в зависимости
                от типа входных данных
    '''

    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата
        
        Параметры:
            a (int | float): длина стороны квадрата

        Возвращаемое значение:
            perimeter (int | float): периметр квадрата
                со стороной длиною a; может быть как целым
                числом (int), так и с плавающей точкой (float),
                в зависимости от типа входных данных
    '''

    return 4 * a
